microchip-pic-avr-examples/dspic33e-code-examples/dspic33e-adc-altsamp/firmware/src/system_config/exp16/dspic33ep512gm710/adcdrv1.c
/*******************************************************************************
  ADC driver functions source file

  Company:
    Microchip Technology Inc.

  File Name:
    adcdrv1.c

  Summary:
    Contains ADC and DMA configuration function definitions.

  Description:
    This source file configures the ADC to alternatively sample two analog input pins in 10-bit
    mode and starts conversion on every time out of the Timer3 module. The Timer3 is configured to 
    time out every 125 us. The DMA is configured in the ping pong mode thus accepting the results
    from the two conversions and placing them in two different buffer locations.    
 *******************************************************************************/
/*******************************************************************************
Copyright (c) 2012 released Microchip Technology Inc.  All rights reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *******************************************************************************/
// *****************************************************************************
// *****************************************************************************
// Section: Included Files
// *****************************************************************************
// *****************************************************************************
#include <xc.h>
#include <stdint.h>
#include "adcdrv1.h"
#include "tglpin.h"

// *****************************************************************************
// *****************************************************************************
// Section: File Scope or Global Constants
// *****************************************************************************
// *****************************************************************************
// Define Message Buffer Length for ECAN1/ECAN2
#define MAX_CHNUM       5           // Highest Analog input number enabled for alternate sampling
#define SAMP_BUFF_SIZE  16          // Size of the input buffer per analog input

//uncomment next line if __eds__ is supported
//#define _HAS_DMA_
// Number of locations for ADC buffer = 2 (AN4 and AN5) x 16 = 32 words
// Align the buffer to 32words or 64 bytes. This is needed for peripheral indirect mode
// DSPIC33EP512GM710 Configuration Bit Settings
// FICD
#pragma config ICS = PGD1           // ICD Communication Channel Select bits (Communicate on PGEC1 and PGED1)
#pragma config JTAGEN = OFF         // JTAG Enable bit (JTAG is disabled)

// FPOR
#pragma config BOREN = ON           // Brown-out Reset (BOR) Detection Enable bit (BOR is enabled)
#pragma config ALTI2C1 = OFF        // Alternate I2C1 pins (I2C1 mapped to SDA1/SCL1 pins)
#pragma config ALTI2C2 = OFF        // Alternate I2C2 pins (I2C2 mapped to SDA2/SCL2 pins)
#pragma config WDTWIN = WIN25       // Watchdog Window Select bits (WDT Window is 25% of WDT period)

// FWDT
#pragma config WDTPOST = PS32768    // Watchdog Timer Postscaler bits (1:32,768)
#pragma config WDTPRE = PR128       // Watchdog Timer Prescaler bit (1:128)
#pragma config PLLKEN = ON          // PLL Lock Enable bit (Clock switch to PLL source will wait until the PLL lock signal is valid.)
#pragma config WINDIS = OFF         // Watchdog Timer Window Enable bit (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF         // Watchdog Timer Enable bit (Watchdog timer enabled/disabled by user software)

// FOSC
#pragma config POSCMD = XT          // Primary Oscillator Mode Select bits (XT Crystal Oscillator Mode)
#pragma config OSCIOFNC = OFF       // OSC2 Pin Function bit (OSC2 is clock output)
#pragma config IOL1WAY = OFF        // Peripheral pin select configuration (Allow multiple reconfigurations)
#pragma config FCKSM = CSECMD       // Clock Switching Mode bits (Clock switching is enabled,Fail-safe Clock Monitor is disabled)

// FOSCSEL
#pragma config FNOSC = FRC          // Oscillator Source Selection (Internal Fast RC (FRC))
#pragma config PWMLOCK = ON         // PWM Lock Enable bit (Certain PWM registers may only be written after key sequence)
#pragma config IESO = OFF           // Two-speed Oscillator Start-up Enable bit (Start up with user-selected oscillator source)

// FGS
#pragma config GWRP = OFF           // General Segment Write-Protect bit (General Segment may be written)
#pragma config GCP = OFF            // General Segment Code-Protect bit (General Segment Code protect is Disabled)
#ifdef _HAS_DMA_
__eds__ int16_t BufferA[MAX_CHNUM + 1][SAMP_BUFF_SIZE] __attribute__( (eds, space(dma), aligned(64)) );
__eds__ int16_t BufferB[MAX_CHNUM + 1][SAMP_BUFF_SIZE] __attribute__( (eds, space(dma), aligned(64)) );
#else
int16_t         BufferA[MAX_CHNUM + 1][SAMP_BUFF_SIZE] __attribute__( (space(xmemory), aligned(64)) );
int16_t         BufferB[MAX_CHNUM + 1][SAMP_BUFF_SIZE] __attribute__( (space(xmemory), aligned(64)) );
#endif

//Function Prototype
void            ProcessADCSamples( __eds__ int16_t *AdcBuffer );

/******************************************************************************
 * Function:        void InitAdc1(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is used to configure A/D to convert 4 inputs alternately and store the
 *                  conversion  results using the DMA.

 *****************************************************************************/
void InitAdc1( void )
{
    AD1CON1bits.FORM = 3;       // Data Output Format: Signed Fraction (Q15 format)
    AD1CON1bits.SSRC = 2;       // Sample Clock Source: GP Timer starts conversion
    AD1CON1bits.ASAM = 1;       // ADC Sample Control: Sampling begins immediately after conversion
    AD1CON1bits.AD12B = 0;      // 10-bit ADC operation
    AD1CON2bits.ALTS = 1;       // Alternate Input Sample Mode Select Bit
    AD1CON2bits.CHPS = 0;       // Converts CH0
    AD1CON3bits.ADRC = 0;       // ADC Clock is derived from Systems Clock
    AD1CON3bits.ADCS = 63;      // ADC Conversion Clock Tad=Tcy*(ADCS+1)= (1/40M)*64 = 1.6us (625Khz)

    // ADC Conversion Time for 10-bit Tc=12*Tab = 19.2us
    AD1CON1bits.ADDMABM = 0;    // DMA buffers are built in scatter/gather mode
    AD1CON2bits.SMPI = 1;       // SMPI Must be programmed to 1 for this case
    AD1CON4bits.DMABL = 4;      // Each buffer contains 16 words
    AD1CON4bits.ADDMAEN = 1;    // Conversion results stored in ADCxBUF0 register

    //AD1CHS0: A/D Input Select Register
    AD1CHS0bits.CH0SA = 4;      // MUXA +ve input selection (AIN4) for CH0
    AD1CHS0bits.CH0NA = 0;      // MUXA -ve input selection (Vref-) for CH0
    AD1CHS0bits.CH0SB = 5;      // MUXB +ve input selection (AIN5) for CH0
    AD1CHS0bits.CH0NB = 0;      // MUXB -ve input selection (Vref-) for CH0
    IFS0bits.AD1IF = 0;         // Clear the A/D interrupt flag bit
    IEC0bits.AD1IE = 0;         // Do Not Enable A/D interrupt
    AD1CON1bits.ADON = 1;       // Turn on the A/D converter
    TglPinInit();
}

/******************************************************************************
 * Function:        void InitTmr3(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:         Timer3 is setup to time-out every 125 microseconds (8Khz Rate). As a result, the module
                     will stop sampling and trigger a conversion on every Timer3 time-out, i.e., Ts=125us.
                     At that time, the conversion process starts and completes Tc=14*Tad periods later.
                     When the conversion completes, the module starts sampling again. However, since Timer3
                     is already on and counting, about (Ts-Tc)us later, Timer3 will expire again and trigger
                     next conversion.
 *****************************************************************************/
void InitTmr3( void )
{
    TMR3 = 0x0000;
    PR3 = 4999;
    IFS0bits.T3IF = 0;
    IEC0bits.T3IE = 0;

    //Start Timer 3
    T3CONbits.TON = 1;
}

/******************************************************************************
 * Function:        void InitDma0(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Direction: Read from peripheral address 0-x300 (ADC1BUF0) and write to DMA RAM
                    AMODE: Register indirect with post increment
                    MODE: Continuous, Ping-Pong Mode
                    IRQ: ADC Interrupt
                    ADC stores results stored alternatively between DMA_BASE[0]/DMA_BASE[16]
 *                  on every 16th DMA request
 *****************************************************************************/
void InitDma0( void )
{
    DMA0CONbits.AMODE = 2;  // Configure DMA for Peripheral indirect mode
    DMA0CONbits.MODE = 2;   // Configure DMA for Continuous Ping-Pong mode
    DMA0PAD = ( int ) &ADC1BUF0;
    DMA0CNT = ( SAMP_BUFF_SIZE * 2 ) - 1;

    DMA0REQ = 13;
    #ifdef _HAS_DMA_
    DMA0STAL = __builtin_dmaoffset( &BufferA );
    DMA0STAH = __builtin_dmapage( &BufferA );

    DMA0STBL = __builtin_dmaoffset( &BufferB );
    DMA0STBH = __builtin_dmapage( &BufferB );
    #else
    DMA0STAL = ( uint16_t ) & BufferA;
    DMA0STAH = ( uint16_t ) & BufferA;

    DMA0STBL = ( uint16_t ) & BufferB;
    DMA0STBH = ( uint16_t ) & BufferB;
    #endif
    IFS0bits.DMA0IF = 0;    //Clear the DMA interrupt flag bit
    IEC0bits.DMA0IE = 1;    //Set the DMA interrupt enable bit
    DMA0CONbits.CHEN = 1;
}

// dmaBuffer variable is used to toggle the buffer between A and B for copying.
uint16_t    dmaBuffer = 0;
#ifdef TEST_MODE
    unsigned char test_dma0_buf_flag=0;
    unsigned char test_dma1_buf_flag=0;
#endif
/******************************************************************************
 * Function:        void __attribute__((interrupt, auto_psv)) _DMA0Interrupt(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Process the data in buffer A or in buffer B by invoking ProcessADCSamples function
 *****************************************************************************/
void __attribute__ ( (interrupt, auto_psv) ) _DMA0Interrupt( void )
{
    if( dmaBuffer == 0 )
    {
#ifdef TEST_MODE
        test_dma0_buf_flag=1;
#endif

        ProcessADCSamples( &BufferA[4][0] );
        ProcessADCSamples( &BufferA[5][0] );
    }
    else
    {
#ifdef TEST_MODE
        test_dma1_buf_flag=1;
#endif
        ProcessADCSamples( &BufferB[4][0] );
        ProcessADCSamples( &BufferB[5][0] );
    }

    dmaBuffer ^= 1;

    TglPin();               // Toggle PORTA, BIT6
    IFS0bits.DMA0IF = 0;    //Clear the DMA0 Interrupt Flag
}

/******************************************************************************
 * Function:        void ProcessADCSamples(__eds__ int16_t * AdcBuffer)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is just a prototype which can be used to perform
 *                  some activity on the samples taken by the ADC.
 *****************************************************************************/
void ProcessADCSamples( __eds__ int16_t *AdcBuffer )
{
    /* Do something with ADC Samples */
}
